lains/stm32-linky-display/src/main.cpp
    /* Initialize the SDRAM */
    BSP_SDRAM_Init();
    //BSP_SD_Init();

    Stm32DebugOutput::get().start();
    Stm32DebugOutput::get().send("Init\n");

    Stm32SerialDriver& ticSerial = Stm32SerialDriver::get();

    //ticSerial.start(9600); /* For standard TIC */
    ticSerial.start(1200); /* For historical TIC */

    Stm32LcdDriver& lcd = Stm32LcdDriver::get();

    //BSP_TS_Init(800,480);
    /* Initialize the LCD */
    OnError_Handler(!lcd.start());

    PowerHistory powerHistory(PowerHistory::Per5Seconds);

    TicFrameParser ticParser(PowerHistory::unWrapOnNewPowerData, (void *)(&powerHistory));

    auto onFrameCompleteBlinkGreenLedAndInvokeHandler = [](void* context) {
#ifdef LED_TIC_FRAME_RX
        Stm32DebugOutput::get().send("Frame complete\n");
        BSP_LED_Toggle(LED_TIC_FRAME_RX); // Toggle the green LED when a frame has been completely received
#endif
        TicFrameParser::unwrapInvokeOnFrameComplete(context);   /* Invoke the frameparser's onFrameComplete handler */
    };

    TIC::Unframer ticUnframer(TicFrameParser::unwrapInvokeOnFrameNewBytes,
                              onFrameCompleteBlinkGreenLedAndInvokeHandler,
                              (void *)(&ticParser));

    TicProcessingContext ticContext(ticSerial, ticUnframer);

    auto performAtMidnight = [](void* context) {
        TicProcessingContext* ticContext = static_cast<TicProcessingContext*>(context);
        ticContext->currentTime.startNewDayAtMidnight();
    };
    ticParser.invokeWhenDayOver(performAtMidnight, static_cast<void*>(&ticContext));
    auto currentTimeGetter = [](void* context) -> TimeOfDay {
        TicProcessingContext* ticContext = static_cast<TicProcessingContext*>(context);
        return ticContext->currentTime.time;
    };
    ticParser.setCurrentTimeGetter(currentTimeGetter, static_cast<void*>(&ticContext));
    auto increaseDatasetErrorCount = [](void* context) {
        TicProcessingContext* ticContext = static_cast<TicProcessingContext*>(context);
        ticContext->datasetsWithErrors++;
        Stm32DebugOutput::get().send("Dataset error\n");
    };
    ticParser.invokeOnDatasetError(increaseDatasetErrorCount, static_cast<void*>(&ticContext));

    powerHistory.setContext(&ticContext);

    Stm32DebugOutput::get().send("Waiting for TIC data...\n");

    auto onSecondElapsed = [](void* context) {
        if (context == nullptr)
            return;
        TicProcessingContext* ticContext = static_cast<TicProcessingContext*>(context);
        ticContext->currentTime.time.addSeconds(1);
    };
    Stm32MonotonicTimeDriver::get().setOnPeriodElapsed(onSecondElapsed, static_cast<void*>(&ticContext));
    Stm32MonotonicTimeDriver::get().start();

#ifdef SIMULATE_POWER_VALUES_WITHOUT_TIC
    auto streamTicRxBytesToUnframer = [](void* context) { }; /* Discard any TIC data */
#else
    auto streamTicRxBytesToUnframer = [](void* context) {
        if (context == nullptr)
            return;
        TicProcessingContext* ticContext = static_cast<TicProcessingContext*>(context);
        uint8_t streamedBytesBuffer[256];  /* We allow copies of max 256 bytes at a time */
        size_t incomingBytesCount = ticContext->ticSerial.read(streamedBytesBuffer, sizeof(streamedBytesBuffer));
        if (incomingBytesCount == 0)
            return;
        // char countAsStr[4];
        // unsigned int pos = 0;
        // if (incomingBytesCount >= 1000) {
        //     countAsStr[0]='+';
        //     countAsStr[1]='+';
        //     countAsStr[2]='+';
        //     countAsStr[3]='\0';
        // }
        // else {
        //     if (incomingBytesCount >= 100) {
        //         countAsStr[pos++] = '0' + (incomingBytesCount / 100)%10;
        //     }
        //     if (incomingBytesCount >= 10) {
        //         countAsStr[pos++] = '0' + (incomingBytesCount / 10)%10;
        //     }
        //     countAsStr[pos++] = '0' + (incomingBytesCount / 1)%10;
        //     countAsStr[pos++] = '\0';
        // }
        // Stm32DebugOutput::get().send("TIC RX ");
        // Stm32DebugOutput::get().send(countAsStr);
        // Stm32DebugOutput::get().send(" bytes: ");
        // Stm32DebugOutput::get().hexdumpBuffer(streamedBytesBuffer, incomingBytesCount);
        // Stm32DebugOutput::get().send("\n");
        std::size_t processedBytesCount = ticContext->ticUnframer.pushBytes(streamedBytesBuffer, incomingBytesCount);
        if (processedBytesCount < incomingBytesCount) {
            size_t lostBytesCount = incomingBytesCount - processedBytesCount;
            if (lostBytesCount > static_cast<unsigned int>(-1)) {
                lostBytesCount = static_cast<unsigned int>(-1); /* Does not fit in an unsigned int! */
            }
            if (static_cast<unsigned int>(-1) - lostBytesCount < ticContext->lostTicBytes) {
                /* Adding lostBytesCount will imply an overflow an overflow of our counter */
                ticContext->lostTicBytes = static_cast<unsigned int>(-1); /* Maxmimize our counter, we can't do better than this */
            }
            else {
                ticContext->lostTicBytes += lostBytesCount;
            }
        }
        unsigned int serialRxOverflowCount = ticContext->ticSerial.getRxOverflowCount(true);
        if (static_cast<unsigned int>(-1) - serialRxOverflowCount < ticContext->serialRxOverflowCount) {
            /* Adding serialRxOverflowBytes will imply an overflow of our counter */
            ticContext->serialRxOverflowCount = static_cast<unsigned int>(-1); /* Maxmimize our counter, we can't do better than this */
        }
        else {
            ticContext->serialRxOverflowCount += serialRxOverflowCount;
        }
    };
#endif
    auto isNoNewPowerReceivedSinceLastDisplay = [](void* context) -> bool {
        if (context == nullptr)
            return true;
        TicProcessingContext* ticContext = static_cast<TicProcessingContext*>(context);
        return (ticContext->lastParsedFrameNb == ticContext->lastDisplayedPowerFrameNb);
    };

