lains/stm32-linky-display/src/main.cpp
    unsigned int lcdRefreshCount = 0;
#ifdef SIMULATE_POWER_VALUES_WITHOUT_TIC
    TimeOfDay fakeHorodate(23, 30, 0); // 23h30m00s
#endif

    TicEvaluatedPower lastReceivedPower;

    uint32_t debugContext = 0;
    while (1) {
        lcd.waitForFinalDisplayed(streamTicRxBytesToUnframer, static_cast<void*>(&ticContext)); /* Wait until the LCD displays the final framebuffer */
        //debugTerm.send("Display refresh\r\n");

        Stm32MeasurementTimer fullDisplayCycleTimeMs(true);

        uint16_t currentPencilYPos = 0;

#ifdef SIMULATE_POWER_VALUES_WITHOUT_TIC
        {
            int fakePowerRefV = static_cast<int>(3000) - (static_cast<int>((lcdRefreshCount*30) % 6000)); /* Results in sweeping from +3000 to -3000W */
            int fakeMinPower = fakePowerRefV;
            int fakeMaxPower = fakePowerRefV;
            if (fakePowerRefV < 0) { /* When reaching negative values, forge a range instead of an exact measurement to be more realistic */
                fakeMinPower = fakePowerRefV/3;
                fakeMaxPower = fakePowerRefV/4; /* If negative, corrects to -3000 to [-1000;-750] */
            }
            TicEvaluatedPower fakePower(fakeMinPower, fakeMaxPower);
            char sampleHorodateAsCString[] = "e230502233000";
            TIC::Horodate fakeTICFrameHorodate = TIC::Horodate::fromLabelBytes(reinterpret_cast<uint8_t*>(sampleHorodateAsCString), strlen(sampleHorodateAsCString));
            fakeTICFrameHorodate.hour = fakeHorodate.hour;
            fakeTICFrameHorodate.minute = fakeHorodate.minute;
            fakeTICFrameHorodate.second = fakeHorodate.second;
            fakeHorodate.addSeconds(30); /* Fast forward in time */
            ticParser.lastFrameMeasurements.instPower = fakePower;
            powerHistory.onNewPowerData(fakePower, fakeHorodate, ticContext.lastParsedFrameNb);
            ticParser.nbFramesParsed++; /* Introspection for debug */
            ticContext.lastParsedFrameNb = ticParser.nbFramesParsed;
        }
#endif
        /* Compute and display the status line */
        unsigned int errors = ticContext.serialRxOverflowCount + ticContext.datasetsWithErrors;
        unsigned int nbSamples = 1;
        PowerHistoryEntry lastMeasurement;
        powerHistory.getLastPower(nbSamples, &lastMeasurement);
        const TimeOfDay* horodateToDisplay = nullptr;
        if (nbSamples == 1 && lastMeasurement.timestamp.isValid) {   /* We have a valid last measurement */
            horodateToDisplay = &(lastMeasurement.timestamp);
        }
        const char* statusLine = getStatusString(lcdRefreshCount, ticParser.nbFramesParsed, ticSerial.getRxBytesTotal(), errors, horodateToDisplay);
        BSP_LCD_SetFont(&Font24);
        auto get_font24_ptr = [](const char c) {
            unsigned int bytesPerGlyph = Font24.Height * ((Font24.Width + 7) / 8);
            return &(Font24.table[(c-' ') * bytesPerGlyph]);
        };
        //lcd.fillRect(0, 0, lcd.getWidth(), Font24.Height, Stm32LcdDriver::LCD_Color::Black);
        
        currentPencilYPos += Font24.Height;
        lcd.drawText(0, currentPencilYPos, statusLine, Font24.Width, Font24.Height, get_font24_ptr, Stm32LcdDriver::LCD_Color::White, Stm32LcdDriver::LCD_Color::Black);

        const char* systemTime = getSystemTimeString(&(ticContext.currentTime));
        Stm32LcdDriver::LCD_Color textColor;
        if (ticContext.currentTime.relativeToBoot) {
            textColor = Stm32LcdDriver::LCD_Color::Red;
        }
        else {
            textColor = Stm32LcdDriver::LCD_Color::Green;
        }
        /* Draw the system time part of the status line (string systemTime) right after statusLine */
        lcd.drawText(strlen(statusLine)*17, currentPencilYPos, systemTime, Font24.Width, Font24.Height, get_font24_ptr, textColor, Stm32LcdDriver::LCD_Color::Black);
        currentPencilYPos += Font24.Height;

        lcd.fillRect(0, currentPencilYPos, lcd.getWidth(), lcd.getHeight() - currentPencilYPos, Stm32LcdDriver::LCD_Color::White);
        ticContext.lastDisplayedPowerFrameNb = ticContext.lastParsedFrameNb; /* Used to detect a new TIC frame and display it as soon as it appears */

        if (ticContext.instantaneousPower.isValid) {
            lastReceivedPower = ticContext.instantaneousPower;
        }
        if (lastReceivedPower.isValid) {   /* We have a valid last measurement */
            const char* mainInstPower = getInstantaneousPowerString(&lastReceivedPower);
   
            lcd.drawText(0, currentPencilYPos, mainInstPower, 60, 120, get_font58_ptr, Stm32LcdDriver::LCD_Color::Blue, Stm32LcdDriver::LCD_Color::White);
        }
        currentPencilYPos += 120; /* Skip the area where last received power was drawn */
        currentPencilYPos -= 15; /* We are not using letters that go below the baseline on font58 (except for the semicolon ';'), so we can afford to go up a bit into that area */
        drawHistory(lcd, 1, currentPencilYPos, lcd.getWidth()-2, lcd.getHeight() - currentPencilYPos - 1, powerHistory, nullptr/*static_cast<void*>(&debugContext)*/);

        debugContext = fullDisplayCycleTimeMs.get();
        /* Counts to 121-157ms depending on the number of columns drawn */
        /* Or without main power display, reduces to 39-75ms */
        /* When using DMA2D (rectangle) to draw solid lines, counts to 118-131ms but a few columns are not drawn properly*/

        {
            Stm32MeasurementTimer displayTimer(true);
            lcd.displayDraft(streamTicRxBytesToUnframer, static_cast<void*>(&ticContext)); /* While waiting, continue forwarding incoming TIC bytes to the unframer */
            //debugContext = displayTimer.get(); /* Counts to 9-10ms */
        }

        {
            Stm32MeasurementTimer fbCopyTimer(true);
            lcd.copyDraftToFinal(); /* 25643 loops without any forced read/write, or 20691 (read+write) loops in the HAL_DMA2D_PollForTransfer() subroutine */
            //debugContext = fbCopyTimer.get(); /* Counts to 16-17ms */
        }

        lcd.requestDisplayFinal(); /* Now we have copied the content to display to final framebuffer, we can perform the switch */

        /* While waiting, continue forwarding incoming TIC bytes to the unframer */
        /* But inject a condition to immediately exit the loop to refresh the display if a new power measurement is received from TIC before the expiration of the wait delay */
        /* The 5s delay should never been reached because TIC data on power comes in more frequently */
#ifndef SIMULATE_POWER_VALUES_WITHOUT_TIC
        waitDelayAndCondition(5000, streamTicRxBytesToUnframer, isNoNewPowerReceivedSinceLastDisplay, static_cast<void*>(&ticContext));
#endif
        {
            unsigned int seconds = ticContext.currentTime.time.toSeconds();
            if (seconds % 10 == 0) {
                if (ticContext.currentTime.relativeToBoot) {
                    Stm32DebugOutput::get().send("Uptime: ");
                }
                else {
                    Stm32DebugOutput::get().send("System time of day: ");
                }
                Stm32DebugOutput::get().send(seconds);
                Stm32DebugOutput::get().send("s\n");
            }
        }
        lcdRefreshCount++;
        if (isNoNewPowerReceivedSinceLastDisplay(static_cast<void*>(&ticContext))) {
            Stm32DebugOutput::get().send("LCD refresh without TIC rx\n");
        }
        else {
            Stm32DebugOutput::get().send("LCD refresh on TIC power rx\n");
        }
    }
}

